Revit 2027 API
ElementIsElementTypeFilter Constructor
 Constructs a new instance of a filter to match only ElementTypes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementIsElementTypeFilter()
Public Sub New
public:
ElementIsElementTypeFilter()
new : unit -> ElementIsElementTypeFilter
See Also
Reference
ElementIsElementTypeFilter Class
ElementIsElementTypeFilter Overload
Autodesk.Revit.DB Namespace